indexxue/esp32-s3/factory/sdkconfig.defaults
# 与量产工程 project 保持一致：N16R8 + 双槽 CSV（厂测固件烧到 app_b / ota_1）。

CONFIG_IDF_TARGET="esp32s3"

CONFIG_IDF_TARGET_ESP32S3=y



CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

CONFIG_ESPTOOLPY_FLASHSIZE="16MB"



CONFIG_PARTITION_TABLE_CUSTOM=y

CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../flash_partition/partitions_16m_n16r8.csv"



# Keep in sync with project/sdkconfig.defaults (N16R8 PSRAM + CPU).

CONFIG_SPIRAM=y

CONFIG_SPIRAM_MODE_OCT=y

CONFIG_SPIRAM_TYPE_AUTO=y

CONFIG_SPIRAM_SPEED_80M=y

CONFIG_SPIRAM_USE_MALLOC=y

CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y

